; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob94) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate6)
	(at pallet1 depot1)
	(clear crate8)
	(at pallet2 depot2)
	(clear crate7)
	(at pallet3 distributor0)
	(clear crate0)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate4)
	(at truck0 distributor0)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot0)
	(available hoist9)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 distributor2)
	(on crate4 pallet5)
	(at crate5 depot1)
	(on crate5 crate2)
	(at crate6 depot0)
	(on crate6 crate3)
	(at crate7 depot2)
	(on crate7 crate1)
	(at crate8 depot1)
	(on crate8 crate5)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 crate6)
		(on crate2 pallet1)
		(on crate3 pallet4)
		(on crate4 crate8)
		(on crate5 crate1)
		(on crate6 pallet2)
		(on crate7 pallet5)
		(on crate8 crate2)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 2 of 9
2. (lift hoist5 crate4 pallet5 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 pallet5)
   added: (lifting hoist5 crate4) (clear pallet5)
   goals met: 2 of 9
3. (lift hoist6 crate7 crate1 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist6) (on crate7 crate1)
   added: (lifting hoist6 crate7) (clear crate1)
   goals met: 2 of 9
4. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 2 of 9
5. (load hoist6 crate7 truck0 depot2)
   deleted: (lifting hoist6 crate7)
   added: (in crate7 truck0) (available hoist6)
   goals met: 2 of 9
6. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 2 of 9
7. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   goals met: 2 of 9
8. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 2 of 9
9. (lift hoist9 crate6 crate3 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist9) (on crate6 crate3)
   added: (lifting hoist9 crate6) (clear crate3)
   goals met: 2 of 9
10. (load hoist9 crate6 truck1 depot0)
   deleted: (lifting hoist9 crate6)
   added: (in crate6 truck1) (available hoist9)
   goals met: 2 of 9
11. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 2 of 9
12. (unload hoist6 crate6 truck1 depot2)
   deleted: (in crate6 truck1) (available hoist6)
   added: (lifting hoist6 crate6)
   goals met: 2 of 9
13. (lift hoist9 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist9) (on crate3 pallet0)
   added: (lifting hoist9 crate3) (clear pallet0)
   goals met: 2 of 9
14. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 2 of 9
15. (load hoist9 crate3 truck1 depot0)
   deleted: (lifting hoist9 crate3)
   added: (in crate3 truck1) (available hoist9)
   goals met: 2 of 9
16. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 2 of 9
17. (unload hoist4 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist4)
   added: (lifting hoist4 crate3)
   goals met: 2 of 9
18. (drop hoist4 crate3 pallet4 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet4)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet4)
   goals met: 3 of 9
19. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 3 of 9
20. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   goals met: 3 of 9
21. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 3 of 9
22. (drop hoist5 crate7 pallet5 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet5)
   goals met: 4 of 9
23. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 4 of 9
24. (drop hoist6 crate6 pallet2 depot2)
   deleted: (lifting hoist6 crate6) (clear pallet2)
   added: (available hoist6) (at crate6 depot2) (clear crate6) (on crate6 pallet2)
   goals met: 5 of 9
25. (drop hoist2 crate1 crate6 depot2)
   deleted: (lifting hoist2 crate1) (clear crate6)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 crate6)
   goals met: 6 of 9
26. (lift hoist1 crate8 crate5 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate5)
   added: (lifting hoist1 crate8) (clear crate5)
   goals met: 6 of 9
27. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 6 of 9
28. (lift hoist1 crate5 crate2 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 crate2)
   added: (lifting hoist1 crate5) (clear crate2)
   goals met: 6 of 9
29. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 6 of 9
30. (unload hoist1 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 6 of 9
31. (drop hoist1 crate8 crate2 depot1)
   deleted: (lifting hoist1 crate8) (clear crate2)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 crate2)
   goals met: 7 of 9
32. (unload hoist1 crate4 truck0 depot1)
   deleted: (in crate4 truck0) (available hoist1)
   added: (lifting hoist1 crate4)
   goals met: 7 of 9
33. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 7 of 9
34. (unload hoist6 crate5 truck0 depot2)
   deleted: (in crate5 truck0) (available hoist6)
   added: (lifting hoist6 crate5)
   goals met: 7 of 9
35. (drop hoist6 crate5 crate1 depot2)
   deleted: (lifting hoist6 crate5) (clear crate1)
   added: (available hoist6) (at crate5 depot2) (clear crate5) (on crate5 crate1)
   goals met: 8 of 9
36. (drop hoist1 crate4 crate8 depot1)
   deleted: (lifting hoist1 crate4) (clear crate8)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate8)
   goals met: 9 of 9
